series&dataframe 연산

In [2]:
#모듈 로딩
import pandas as pd

In [3]:
#데이터 준비
file_name='data1.csv'

In [4]:
#csv -> df
csvdf=pd.read_csv(file_name,header=None)

In [5]:
csvdf

    0   1   2
0  10  20  30
1  90  80  70
2  66  55  44
3  90  90  90
4   5   5   5

In [6]:
#연산 실습_0번 컬럼+2번 컬럼
result=csvdf[0]+csvdf[2]
result

0     40
1    160
2    110
3    180
4     10
dtype: int64

In [7]:
#연산 실습_0~2번 컬럼 다 더하기
result=csvdf[0]+csvdf[1]+csvdf[2]
result

0     60
1    240
2    165
3    270
4     15
dtype: int64

In [8]:
#3개 컬럼 더한 결과 새로운 컬럼에 추가
csvdf['total']=result
csvdf

    0   1   2  total
0  10  20  30     60
1  90  80  70    240
2  66  55  44    165
3  90  90  90    270
4   5   5   5     15

In [9]:
#행 5에 각 컬럼별 합계 추가
result=csvdf.loc[0]+csvdf.loc[1]+csvdf.loc[2]+csvdf.loc[3]+csvdf.loc[4]
csvdf.loc[5]=result
csvdf

     0    1    2  total
0   10   20   30     60
1   90   80   70    240
2   66   55   44    165
3   90   90   90    270
4    5    5    5     15
5  261  250  239    750

In [20]:
#series 연산 수행 메서드_합계
sr0=csvdf[0]
sr0.sum()

csvdf

     0    1    2  total
0   10   20   30     60
1   90   80   70    240
2   66   55   44    165
3   90   90   90    270
4    5    5    5     15
5  261  250  239    750

In [11]:
#series 연산 수행 메서드_최댓값
sr0=csvdf[0]
sr0.max()

261

In [12]:
#series 연산 수행 메서드_최솟값
sr0=csvdf[0]
sr0.min()

5

In [13]:
#df 연산 수행 메서드_합계
print(csvdf.sum())    #컬럼별 합계

print(csvdf.sum(axis=1))   #행별 합계

0         522
1         500
2         478
total    1500
dtype: int64
0     120
1     480
2     330
3     540
4      30
5    1500
dtype: int64

In [14]:
#df 연산 수행 메서드_최댓값
print(csvdf.max())    #컬럼별 최댓값

print(csvdf.max(axis=1))   #행별 최댓값

0        261
1        250
2        239
total    750
dtype: int64
0     60
1    240
2    165
3    270
4     15
5    750
dtype: int64

In [15]:
#df 연산 수행 메서드_최솟값
print(csvdf.min())    #컬럼별 최솟값

print(csvdf.min(axis=1))   #행별 최솟값

0         5
1         5
2         5
total    15
dtype: int64
0     10
1     70
2     44
3     90
4      5
5    239
dtype: int64

연산-데이터 추출

연산 결과와 데이터 추출을 함께 진행

In [16]:
#total이 100 이상인 데이터만 추출
csvdf.total

0     60
1    240
2    165
3    270
4     15
5    750
Name: total, dtype: int64

In [17]:
bool_index=csvdf.total>100
bool_index

0    False
1     True
2     True
3     True
4    False
5     True
Name: total, dtype: bool

t/f로 구성된 series: boolen index => 인덱스로 특정 데이터 추출에 사용 가능

In [18]:
csvdf[bool_index]

     0    1    2  total
1   90   80   70    240
2   66   55   44    165
3   90   90   90    270
5  261  250  239    750